IDEA Connection Link
ConnectionSrv.GetDetailedConResultsData Method
 Get detailed results of checks
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public CheckResultsData GetDetailedConResultsData(
	Guid connectionId
)
Public Function GetDetailedConResultsData (
	connectionId As Guid
) As CheckResultsData
public:
CheckResultsData^ GetDetailedConResultsData(
	Guid connectionId
)
Parameters
connectionId
Type: System.Guid
Id of the connection
Return Value
Type: CheckResultsData
[Missing <returns> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.GetDetailedConResultsData(System.Guid)"]
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace